# RuleType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..RuleType Property
ElectricalDemandFactorDefinition Class See Also
---
The rule type for this demand factor definition.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElectricalDemandFactorRule RuleType { get; set; }
```

Visual Basic
---
```text
Public Property RuleType As ElectricalDemandFactorRule
	Get
	Set
```

Visual C++
---
```text
public:
property ElectricalDemandFactorRule RuleType {
	ElectricalDemandFactorRule get ();
	void set (ElectricalDemandFactorRule value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace